Revit 2026 API

# RebarMaxSpacing Property

---

Identifies the maximum spacing between rebar in rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MaxSpacing { get; set; }
```
```vb
Public Property MaxSpacing As Double
	Get
	Set
```
```cpp
public:
property double MaxSpacing {
	double get ();
	void set (double value);
}
```
```fsharp
member MaxSpacing : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The maxSpacing isn't bigger than 0.0. |
| InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). -or- When setting this property: The rebar set layout does not permit changing the maximum spacing. |

The maximum spacing can be set for rebar sets with layout rule MaximumSpacing, MinimumClearSpacing, or NumberWithSpacing.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace